dsgt-soap/requestcheapest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://foodmenu.io/gt/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCheapestMealRequest/>
    </soapenv:Body>
</soapenv:Envelope>